vjdias/stm32_cnc_controller/CNC_Controller/App/Src/Services/Motion/motion_service.c
    if (g_demo_continuous) {
        for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
            motion_axis_state_t *ax = &g_axis_state[axis];

            if (ax->emitted_steps >= ax->total_steps) continue;

            /* guardas de ENABLE e DIR (atendem setup/hold do TMC5160) */
            if (ax->en_settle_ticks)  { ax->en_settle_ticks--;  continue; }
            if (ax->dir_settle_ticks) { ax->dir_settle_ticks--; continue; }

            if (ax->step_high) continue; /* ainda segurando pulso ALTO */
            if (ax->step_low)  continue; 

            /* DDA: acumula fase e emite STEP ao cruzar 1.0 */
            ax->dda_accum_q16 += ax->dda_inc_q16;
            if (ax->dda_accum_q16 >= Q16_1) {
                ax->dda_accum_q16 -= Q16_1;

                motion_hw_step_high(axis);
                ax->step_high = MOTION_STEP_HIGH_TICKS;
                ++ax->emitted_steps;
                g_csv_stepcount[axis]++;
                if (!g_csv_active[axis]) {
                    g_csv_active[axis] = 1u;
                    g_csv_armed[axis]  = 0u;
                    uint32_t now_t6 = g_tim6_ticks;
                    g_csv_t0_t6[axis] = now_t6;
                    g_csv_next_t6[axis] = now_t6;
                }
#if MOTION_CSV_AT_STEP && !MOTION_CSV_PRODUCE_IN_TIM6
                if (g_csv_active[axis]) {
                    uint32_t dt_t6 = g_tim6_ticks - g_csv_t0_t6[axis];
#if MOTION_CSV_TIME_IN_TICKS
                    uint32_t t_val = dt_t6;
#else
                    uint32_t t_val = dt_t6 / T6_TICKS_PER_MS;
#endif
                    int32_t rel = (int32_t)(g_encoder_position[axis] - g_encoder_origin[axis]);
                    if (g_csv_stepcount[axis] == 1u || (g_csv_stepcount[axis] % MOTION_CSV_STEP_DECIM) == 0u) {
                        uint32_t pm = motion_lock();
                        uint32_t id = ++g_csv_seq[axis];
                        motion_unlock(pm);
                        motion_csv_print(axis, id, t_val, rel, g_csv_stepcount[axis]);
                    }
                }
#endif
#if MOTION_DEBUG_FLOW
                #if MOTION_DEBUG_TIM6_PRINTS
                if ((++g_step_print_count[axis] % MOTION_DEBUG_STEP_DECIM) == 1u) {
                    printf("[STEP axis=%u emitted=%lu target=%lu total=%lu]\r\n",
                           (unsigned)axis,
                           (unsigned long)ax->emitted_steps,
                           (unsigned long)ax->target_steps,
                           (unsigned long)ax->total_steps);
                }
                #endif
#endif
            }
        }
    }
    else {
        /* 3) Caminho original (fila): preservado */
        for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
            motion_axis_state_t *ax = &g_axis_state[axis];

            if (ax->step_high) continue;
            if (ax->step_low)  continue; 
            if (ax->emitted_steps >= ax->total_steps) continue;

            if (ax->en_settle_ticks)  { ax->en_settle_ticks--;  continue; }
            if (ax->dir_settle_ticks) { ax->dir_settle_ticks--; continue; }

            /* DDA (fila): acumula fase e emite STEP no cruzamento de 1.0 */
            ax->dda_accum_q16 += ax->dda_inc_q16;
            if (ax->dda_accum_q16 >= Q16_1) {
                ax->dda_accum_q16 -= Q16_1;
                if (ax->emitted_steps < ax->total_steps) {
                    motion_hw_step_high(axis);
                    ax->step_high = MOTION_STEP_HIGH_TICKS;
                    ++ax->emitted_steps;
                    g_csv_stepcount[axis]++;
                    ax->target_steps = ax->emitted_steps;
                    /* Garanta ativação no primeiro STEP mesmo se o "arming" atrasar */
                    if ((g_csv_armed[axis] || g_csv_stepcount[axis] == 1u) && !g_csv_active[axis]) {
                        g_csv_active[axis] = 1u;
                        g_csv_armed[axis]  = 0u;
                        uint32_t now_t6 = g_tim6_ticks;
                        g_csv_t0_t6[axis] = now_t6;
                        g_csv_next_t6[axis] = now_t6;
                    }
#if MOTION_CSV_AT_STEP && !MOTION_CSV_PRODUCE_IN_TIM6
                    if (g_csv_active[axis]) {
                        uint32_t dt_t6 = g_tim6_ticks - g_csv_t0_t6[axis];
#if MOTION_CSV_TIME_IN_TICKS
                        uint32_t t_val = dt_t6;
#else
                        uint32_t t_val = dt_t6 / T6_TICKS_PER_MS;
#endif
                        int32_t rel = (int32_t)(g_encoder_position[axis] - g_encoder_origin[axis]);
                        if (g_csv_stepcount[axis] == 1u || (g_csv_stepcount[axis] % MOTION_CSV_STEP_DECIM) == 0u) {
                            uint32_t pm = motion_lock();
                            uint32_t id = ++g_csv_seq[axis];
                            motion_unlock(pm);
                            motion_csv_print(axis, id, t_val, rel, g_csv_stepcount[axis]);
                        }
                    }
#endif
#if MOTION_DEBUG_FLOW
                    #if MOTION_DEBUG_TIM6_PRINTS
                    if ((++g_step_print_count[axis] % MOTION_DEBUG_STEP_DECIM) == 1u) {
                        printf("[STEP axis=%u emitted=%lu target=%lu total=%lu]\\r\\n",
                               (unsigned)axis,
                               (unsigned long)ax->emitted_steps,
                               (unsigned long)ax->target_steps,
                               (unsigned long)ax->total_steps);
                    }
                    #endif
#endif
                }
            }
        }
    }

#if MOTION_CSV_PRODUCE_IN_TIM6
    /* 4) Produção rígida de amostras a cada 1 ms (50 ticks), sem imprimir
       - Apenas empilha amostras para drenagem posterior (TIM7).
       - Começa após o primeiro STEP (g_csv_active[axis]==1). */
    {
        uint32_t now_t6 = g_tim6_ticks;
        if ((int32_t)(now_t6 - g_csv_next_prod_t6) >= 0) {
            /* gera 1..K amostras de 1ms (se houver atraso ocasional) */
            do {
                for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
                    if (!g_csv_active[axis]) continue; /* iniciar no primeiro STEP */
                    uint32_t dt_t6 = now_t6 - g_csv_t0_t6[axis];
                    long rel = (long)(g_encoder_position[axis] - g_encoder_origin[axis]);
                    uint32_t pm = motion_lock();
                    uint32_t id = ++g_csv_seq[axis];
                    motion_unlock(pm);
                    csv_ring_push(axis, id, dt_t6, (int32_t)rel, g_csv_stepcount[axis]);
                }
                g_csv_next_prod_t6 += T6_TICKS_PER_MS;
            } while ((int32_t)(now_t6 - g_csv_next_prod_t6) >= 0);
        }
    }
#endif

